Revit 2024 API
ParameterTypeId.TilePatternGridUnitX Property
 "Horizontal spacing"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId TilePatternGridUnitX { get; }
Visual Basic
Public Shared ReadOnly Property TilePatternGridUnitX As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ TilePatternGridUnitX {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace